RedditRails/app/controllers/subs_controller.rb

INSERT INTO "subs" ("title", "description", "mod_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Junk"], ["description", "I wish they would stop making that noise "], ["mod_id", 3], ["created_at", "2022-04-08 22:39:21.508534"], ["updated_at", "2022-04-08 22:39:21.508534"]]
---
    def create
        @sub = Sub.new(sub_params)
        @sub.mod_id = current_user.id
        if @sub.save